import { Diary } from "../types/diary";

export const fishDiary: Diary[] = [
  {
    century: 1,
    year: 1,
    title: '我的第一篇日記',
    content: `我們星靈是一種趨近永恆的存在，在永無止盡的時間長河中，難免會遺落一些珍貴的回憶，這令我感到悲傷。
    於是我找小環商量這件事，沒想到小環竟然幫我做出了能夠將回憶以文字的形式儲存下來的機器，真不愧是最聰明的星靈。
    嘻嘻，她平日雖然毒舌，但心裡其實比誰都在乎我們呢。
    總之，之後我會將我們之間每一份快樂的回憶都記錄在這裡，如此一來這些美好就能永遠地被保存下來了吧。`,
    comments: [
      {
        author: 'snake',
        content: `笨、笨蛋！星靈日記是為了記錄我們存在的歷史，才不是為了妳做的！
        沒錯，妳不過是為了完成史書而打白工的勞動力！
        呵呵，就以這值得紀念的第一篇日記的日期，訂為1星紀元年吧。`
      },
      {
        author: 'fish',
        content: `小環真不坦率呢～`
      },
      {
        author: 'snake',
        content: `才沒有！！`
      },
      {
        author: 'dog',
        content: '這是甚麼這是甚麼！好像很有趣！我也要開始寫日記！'
      },
      {
        author: 'chikun',
        content: '+1'
      },
      {
        author: 'fish',
        content: '大家一起把每個美好的剎那變成永恆吧～'
      }
    ]
  },
  {
    century: 1,
    year: 2,
    title: '小牙與飛盤',
    content: `丟飛盤是小牙最喜歡的遊戲之一，每次丟飛盤時，他的笑容都無比燦爛，看他如此開心，我的嘴角也不禁上揚，快樂是真的會傳染。
    另外小環做的飛盤也很厲害，只要輕輕一擲就能飛越星河，哪怕是小牙也得花一盞茶的時間才能把飛盤刁回來。
    如果是普通的飛盤，大概沒有人能讓小牙玩得盡興吧。`,
    comments: [
      {
        author: 'dog',
        content: '開心！汪！'
      }
    ]
  },
  {
    century: 1,
    year: 12,
    title: '最棒的演唱會',
    content: `今天是小冠演唱會的日子，我們在小環的帶領下來到一台飛碟狀、剛好能容納一座舞台的機器前，據小環的說法，那好像是「貨車」？
    然後小環讓我們戴上一副無線耳機，接著神奇的事發生了——我們的意識竟被抽離肉體！
    宛如靈魂出竅一般，我們都變成了音符，出現在那飛碟狀機器的舞台之中。只有小冠沒變成音符，他站在舞台中央聚光燈下，隨著音樂響起開嗓，舞台竟然跟著動了起來。
    我們都沉醉在清朗明快的歌聲中，隨著音樂節奏律動。當小冠的節奏加快，我們頭頂劃過無數道流星雨；歌曲來到平靜之處，滿天星星開始悠轉，像是在為副歌的爆發做鋪墊；而小冠唱到最高潮時，更是讓繁星都開始閃爍，彷彿世界都隨著小冠的節奏震盪！
    直到我們的意識回到身體，都還有點分不清身處虛幻或現實。只能說小冠餘音繞樑的歌聲，再加上小環的設備輔助，兩者交織出的這場五感盛宴絕對是空前絕後。
    今天實在是太滿足了，我一輩子都不會忘記這場演唱會。`,
    comments: [
      {
        author: 'chikun',
        content: '謝謝～演唱會能如此成功，都要感謝在座每一位的參與！'
      },
      {
        author: 'snake',
        content: '哼，鰭姊是在誇我好嗎？'
      },
      {
        author: 'fish',
        content: '呵呵，都誇，你們倆都最棒了！'
      }
    ]
  },
  {
    century: 1,
    year: 58,
    title: '外星使節的聯絡',
    content: `今天接到天雲系-α外交使節的聯繫，說是想和我們簽訂以促進科技進步為目的的學術交流條款。
    但我大致看過了款項，雖然我不懂那些太複雜的事，但總感覺完全是不平等條約，就像是要我們單方面把所有的知識及財產權交出去一樣，而他們幾乎沒回饋甚麼給我們。
    對方的態度也是一副高高在上的，讓我很不舒服。
    不過畢竟是小環的研究，而且這件事可能關係到我們全體，我決定等跟大家討論完再決定如何回覆。
    希望不要演變成甚麼大事。`,
    comments: [
      {
        author: 'chikun',
        content: '條款我看了，比美麗鰹娛樂還黑。'
      },
      {
        author: 'snake',
        content: '我也看了，純傻逼。'
      },
      {
        author: 'cat',
        content: '我可以對他們惡作劇嗎？可以吧？沒人會攔我吧？'
      },
      {
        author: 'fish',
        content: '小無形先不要……'
      }
    ]
  },
  {
    century: 1,
    year: 59,
    title: '戰爭？',
    content: `那之後我們開了個會，討論的結果是全員一致決定不簽訂學術交流條款。
    我將這項決定告知天雲系-α外交使節後，本以為這件事能就此落幕，沒想到翌日，他們開了好幾艘航母過來，一見面就是一發激光砲，在我們這轟出一個大坑，還好大家都沒受傷。
    他們說我們意圖壟斷技術，妨礙文明進步，還說我們是千古罪人，要聯合天雲系-γ、梅比烏斯星系、多葛瑪星系組成星際聯軍討伐我們，而剛才那一發轟炸就是宣戰。
    這可把我說委屈了，小牙也齜牙低吼著，小環甚至直接進實驗室抄傢伙，不過沒等我們任何一方反應過來，小爪二話不說就把他們乘坐的航母給拆了。
    要是平時我可能會唸他幾句，但既然是對方宣戰在先，小爪也只能算是正當防衛吧。嗯～解氣！
    不過這下是真要打起來了，唉。`,
    comments: [
      {
        author: 'cat',
        content: '解氣！'
      },
      {
        author: 'dog',
        content: '解氣！'
      },
      {
        author: 'snake',
        content: '解氣！'
      },
      {
        author: 'chikun',
        content: '解氣！'
      }
    ]
  },
  {
    century: 1,
    year: 60,
    title: '小牙受傷了……',
    content: `是我沒保護好小牙。
    是我不好。
    都怪我，都是我的錯，如果我當時簽了條約，小牙就不會受傷了。
    都是我不好。
    如果我阻止小牙衝上去，如果我在他們開槍之前趕到小牙身邊，如果我……
    都是我不好。
    是我太軟弱，是我不夠果斷，是我沒用，是我是我是我是我是我都是我……
    對不起，小牙。`,
    comments: []
  },
  {
    century: 2,
    year: 1,
    title: '新紀快樂！',
    content: `祝大家心想事成，新紀行大運！`,
    comments: [
      {
        author: 'dog',
        content: '新紀快樂！'
      },
      {
        author: 'cat',
        content: '紅包拿來'
      },
      {
        author: 'chikun',
        content: '新紀快樂～'
      },
      {
        author: 'snake',
        content: '樂。'
      }
    ]
  }
]