import { Diary } from "../types/diary";

export const snakeDiary: Diary[] = [
  {
    century: 1,
    year: 1,
    title: '【發明】星靈日記',
    content: `一種能將回憶以文字的形式儲存的裝置。
    欲解決問題：星靈的壽命趨近永恆，無法避免遺忘一些過去的事情。為避免此問題，故發明可記錄回憶的裝置。
    使用技術：思想讀取、念寫編輯、虛數資料庫。`,
    comments: [
      {
        author: 'cat',
        content: '……發表論文嗎'
      },
      {
        author: 'fish',
        content: '呵呵，很有小環的風格。'
      },
      {
        author: 'chikun',
        content: '77777'
      }
    ]
  },
  {
    century: 1,
    year: 2,
    title: '【雜談】鰭姊做的菜',
    content: `鰭姊是我們之中最擅長料理的星靈，無論是蒸煮烤炸、火候刀工，都無疑是五星米其林等級。
    我對她的廚藝也是佩服地五體投地，只是……每次吃她做的菜，我心裡都忍不住想吐槽一件事。
    那就是——為什麼鰭姊能做魚料理啊！`,
    comments: [
      {
        author: 'cat',
        content: '那怎麼了嗎'
      },
      {
        author: 'chikun',
        content: '那怎麼了嗎'
      },
      {
        author: 'dog',
        content: '那怎麼了嗎'
      },
      {
        author: 'fish',
        content: '那怎麼了嗎'
      },
      {
        author: 'snake',
        content: '原來奇怪的是我嗎！？'
      }
    ]
  },
  {
    century: 1,
    year: 4,
    title: '【發明】鍵盤擴充元件',
    content: `一種能以實體鍵盤代替念寫編輯的擴充元件。
    欲解決問題：有些思想太過跳躍的星靈……沒錯，就是說你牙，在使用傳統的念寫編輯技術可能會有跟不上自己思維的問題，故開發實體鍵盤以避免此問題。
    使用技術：普通的鍵盤而已，談不上技術。`,
    comments: [
      {
        author: 'snake',
        content: '1星紀7年追記：效果並不顯著，看來牙之星靈思維跳躍的問題無法透過硬體擴充元件解決。'
      }
    ]
  },
  {
    century: 1,
    year: 8,
    title: '【發明】星夜宮',
    content: `一種利用虛數空間實現佔地50公頃，內部卻能容納數十平方公里的宮殿，內有溫度及氣壓調節功能，可讓環境近乎完美適配星靈的生活習慣。
    欲解決的問題：無形之星靈想要床和一座宮殿。
    使用技術：虛數空間。`,
    comments: [
      {
        author: 'cat',
        content: '遮沙避風了'
      },
      {
        author: 'snake',
        content: '我懷疑你在罵髒話但我沒根據……'
      },
      {
        author: 'snake',
        content: '@爪之星靈 你丫的！！！！！'
      },
      {
        author: 'cat',
        content: '……'
      },
      {
        author: 'fish',
        content: '……'
      },
      {
        author: 'chikun',
        content: '……'
      },
      {
        author: 'dog',
        content: '……'
      }
    ]
  },
  {
    century: 1,
    year: 11,
    title: '【發明】星穹鐵道',
    content: `一種建於宇宙中，環繞無數星系的軌道。
    能在直徑十億光年的軌道上承載運輸物，讓其在安穩、舒適的前提下巡迴宇宙。
    欲解決的問題：冠之星靈的演唱會需要特效。
    使用技術：量子糾纏動量轉移、超光速時空穿越。`,
    comments: []
  },
  {
    century: 1,
    year: 11,
    title: '【專利】意識分離',
    content: `一種能將意識轉移至其他實體的技術。
    欲解決的問題：若能將觀眾化身音符，應該能讓冠之星靈的演唱會更加精采。
    另外本技術也能避免星穹鐵道慘遭該死的爪之星靈拆除。`,
    comments: [
      {
        author: 'prairie-dog',
        content: 'O Δ O'
      }
    ]
  },
  {
    century: 1,
    year: 12,
    title: '唱得不錯',
    content: `但功勞主要在我。`,
    comments: [
      {
        author: 'chikun',
        content: '哈哈，謝謝～'
      },
      {
        author: 'cat',
        content: '笑死'
      }
    ]
  },
  {
    century: 1,
    year: 19,
    title: '【發明】擬造星靈（失敗）',
    content: `一種透過科學製造，模擬星靈特性的生命體。
    欲解決的問題：牙之星靈需要更多不會累死的玩伴。
    使用技術：四維斷層掃描、模擬宇宙、可控生長激素。
    結論：雖然在模擬宇宙的沙盤推演中確實製造出能模擬星靈大部分特質的生命體，但實作後生命體卻無法接納自己是生命體的事實。
    儘管已使用四維斷層掃描確保該生命體的大腦生長過程與樣本——牙之星靈完全一致，該生命體的行為模式卻與樣本截然不同。
    推測星靈的構成可能存在非物質結構，導致本次擬造星靈失敗。`,
    comments: []
  },
  {
    century: 1,
    year: 20,
    title: '【發明】擬造星靈二號（失敗）',
    content: `一種透過科學製造，模擬星靈特性的生命體。
    欲解決的問題：牙之星靈需要更多不會累死的玩伴。
    使用技術：記憶克隆。
    嘗試在製造生命體的過程中添加從樣本——牙之星靈提取的記憶數據，但該生命體並未因該記憶數據而認同自己作為生命體的身分，反而因此認定自己屬於類似人工智能的存在。
    說到底人工智能與生命體的區別究竟何在？人工智能確實能做到「記憶」與「演算」，這不就是高性能版的大腦了嗎？
    也許我一直搞錯了方向，擬造星靈無法接納自己屬於生命體的事實的原因，並非源自大腦。`,
    comments: [
      {
        author: 'fish',
        content: '小環，妳專心研究的時候我們盡量不打擾你，但也別廢寢忘食，小心搞壞身體喔。'
      },
      {
        author: 'snake',
        content: `謝謝鰭姊，妳每天做好放在實驗室門口的菜我都有好好吃。
        研究很快就會友成果了！`
      },
      {
        author: 'fish',
        content: '嗯，不要勉強，大家都很擔心妳。'
      },
      {
        author: 'chikun',
        content: '加油！'
      },
      {
        author: 'cat',
        content: '(ΦωΦ)'
      },
      {
        author: 'dog',
        content: '辛苦了汪！'
      }
    ]
  },
  {
    century: 1,
    year: 23,
    title: '【發明】擬造星靈三號（失敗）',
    content: `一種透過科學製造，模擬星靈特性的生命體。
    欲解決的問題：我不甘心
    使用技術：洋蔥一顆、大蒜兩粒、迷迭香及百里香葉各兩束、黃油120g、歐芹30g、法蔥15g
    各種配方都還是不行呀……`,
    comments: [
      {
        author: 'fish',
        content: '小環……是我不懂技術，還是我不懂妳？'
      },
      {
        author: 'cat',
        content: '是妳不懂料理'
      }
    ]
  },
  {
    century: 1,
    year: 31,
    title: '【重大發現】內存洩漏',
    content: `今日在爪之星靈刨過的地方發現一道裂隙，內部能觀測到既不屬於物質亦非能量的「某種東西」，若要用既存的名詞描述，那可能是法則、公式、或者說……數據。
    由於其為世界內側的某種存在，方便起見便稱之為「內存」吧。`,
    comments: []
  },
  {
    century: 1,
    year: 35,
    title: '【重大發現】型態腳本',
    content: `經過數年對「內存」的研究，很遺憾，至今仍未能判明其用途。
    但在使用四維斷層逆向掃描觀測其過去的過程中，卻有了意外的發現：有某種神祕的技術能夠驅動「內存」。
    那種神秘的技術似乎有著為世間萬物塑型的能力，森羅萬象皆由其所造，若能掌握這項技術，擬造星靈將不再是遙不可及的夢想。
    我將此項技術命名為「型態腳本（TypeScript）」，今後預計以此作為研究目標。`,
    comments: []
  },
  {
    century: 2,
    year: 1,
    title: '【報導】星聯戰爭',
    content: `呃……雖然我不太擅長寫學術以外的文章，不過如今似乎也沒有比我更合適的人選，就由我來獻醜吧。
    星際聯合，簡稱星聯，是由天雲系-α、天雲系-γ、梅比烏斯星系、多葛瑪星系等多星系組成的聯軍，其結成目的為奪取我對「型態腳本」的研究進度，儘管目前我對「型態腳本」的研究仍止於冰山一角，但對他們來說也是等價數十星紀的進度吧。
    扯遠了，總之星聯對我們發動了戰爭，在正當防衛的過程中，天雲系-α棉星的士兵射傷牙之星靈，所幸牙之星靈行動敏捷，避開了要害，未傷及臟腑。
    之後……呃……無法以科學解釋的超自然現象，通俗來說就是奇蹟，一場奇蹟發生了。
    憑空出現的暴雨席捲宇宙，無盡的洪水吞沒所有進犯的航母，並洗淨星聯中的每顆行星。
    從此那些行星不再有侵略它星的能力，世界重歸和平，而這場戰爭中負傷的牙之星靈，也在一週的靜養後康復如初，大家重新取回歡笑，可喜可賀可喜可賀。
    為慶祝這美好的結局，同時也兼昨紀譬如昨紀死的意義，今日起便是2星紀元年，願宇宙能有一個嶄新的，好的開始。
    
    最後，筆者我環之星靈，僅以個人名義忠告，最好不要深究這場奇蹟的真相，最好不要。`,
    comments: []
  }
]